---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips
source: html/c44f95fb-7715-9a04-08a2-c22acea42d57.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips

Defines parameters for structural Sigma Profile section with lips.

## Syntax (C#)
```csharp
public class StructuralSectionSigmaProfileWithLips : StructuralSectionColdFormed
```